<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"dcc1ad9a1afba0464e799d16cef9558469bb9b920c4c5ac444c8bd567e267468","plan_job_ref":"Job Infrastructure #366 at https://github.com/coverage-robot/core/actions/runs/8149746061","plan_out_hash":"290f23cf101929ed67f5d0c73a46e8d719eb4b862c1f2819e24032cd379adca0","plan_hash":"14e58d7ea1f49151c272c7de3373190aba1ea13c91e4a2c661ed76f494c000b5","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.events.aws_iam_policy.coverage_event_scheduler_policy will be created
+   resource "aws_iam_policy" "coverage_event_scheduler_policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "coverage-event-scheduler-policy-prod"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Statement = [
+                           {
+                               Action   = [
+                                   "events:PutEvents",
                                ]
+                               Effect   = "Allow"
+                               Resource = [
+                                   {
+                                       arn               = "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod"
+                                       event_source_name = null
+                                       id                = "coverage-events-prod"
+                                       name              = "coverage-events-prod"
+                                       tags              = {}
+                                       tags_all          = {}
                                    },
                                ]
                            },
                        ]
+                       Version   = "2012-10-17"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.events.aws_iam_role.coverage_event_scheduler_role will be created
+   resource "aws_iam_role" "coverage_event_scheduler_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "coverage-event-scheduler-role-prod"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.events.aws_iam_role_policy_attachment.coverage_event_scheduler_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "coverage_event_scheduler_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "coverage-event-scheduler-role-prod"
    }

  # module.warehouse.google_bigquery_table.coverage will be updated in-place
!~  resource "google_bigquery_table" "coverage" {
        id                       = "projects/coverage-384615/datasets/prod/tables/line_coverage"
-       require_partition_filter = true -> null
#        (19 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
!~      etag                        = "/o04AsEJ1S1KUVFaA9mT8A==" -> "LlR65LQ0obbri5DoznfmaA=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
!~      last_modified_time          = 1707765487249 -> 1709602953578
!~      num_bytes                   = 1634454921141 -> 1832807343726
!~      num_rows                    = 3822749326 -> 4271781899
!~      require_partition_filter    = false -> null
#        (25 unchanged attributes hidden)
    }
!~  upload_table              = {
        id                          = "projects/coverage-384615/datasets/prod/tables/upload"
!~      last_modified_time          = 1707764948864 -> 1709602564577
!~      num_bytes                   = 12052023 -> 13833916
!~      num_rows                    = 45265 -> 51931
#        (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #366](https://github.com/coverage-robot/core/actions/runs/8149746061)